TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G3507/driverlib/empty_driverlib_src/ti/driverlib/dl_timerb.h
/*
 * Copyright (c) 2025, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_timerb.h
 *  @brief      Basic Timer (BTIM) Driver Library
 *  @defgroup   BTIM Basic Timer (BTIM)
 *
 *  @anchor ti_dl_dl_timerb__Overview
 *  # Overview
 *  The Basic Timer (BTIM) Driver Library allows full configuration of the
 *  MSPM0 BTIM module. The BTIM module is an array of counters which can
 *  generate periodic interrupts, be concatenated to create longer time
 *  durations, and measure timing properties of external events.
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup BTIM
 * @{
 */
#ifndef ti_dl_dl_timerb__include
#define ti_dl_dl_timerb__include

#include <stdbool.h>
#include <stdint.h>

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/dl_common.h>

#ifdef __MSPM0_HAS_TIMER_B__

#ifdef __cplusplus
extern "C" {
#endif

/* clang-format off */

/** @addtogroup DL_TIMERB_INTERRUPT
 *  @{
 */

/*!
 * @brief Counter 0 Overflow interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT0_OVF_EVENT   (BTIMER_CPU_INT_IMASK_CNT0OVF_SET)

/*!
 * @brief Counter 0 Start interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT0_START_EVENT (BTIMER_CPU_INT_IMASK_CNT0STRT_SET)

/*!
 * @brief Counter 0 Stop interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT0_STOP_EVENT (BTIMER_CPU_INT_IMASK_CNT0STOP_SET)

/*!
 * @brief Counter 1 Overflow interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT1_OVF_EVENT   (BTIMER_CPU_INT_IMASK_CNT1OVF_SET)

/*!
 * @brief Counter 1 Start interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT1_START_EVENT (BTIMER_CPU_INT_IMASK_CNT1STRT_SET)

/*!
 * @brief Counter 1 Stop interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT1_STOP_EVENT (BTIMER_CPU_INT_IMASK_CNT1STOP_SET)

/*!
 * @brief Counter 2 Overflow interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT2_OVF_EVENT   (BTIMER_CPU_INT_IMASK_CNT2OVF_SET)

/*!
 * @brief Counter 2 Start interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT2_START_EVENT (BTIMER_CPU_INT_IMASK_CNT2STRT_SET)

/*!
 * @brief Counter 2 Stop interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT2_STOP_EVENT (BTIMER_CPU_INT_IMASK_CNT2STOP_SET)

/*!
 * @brief Counter 3 Overflow interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT3_OVF_EVENT   (BTIMER_CPU_INT_IMASK_CNT3OVF_SET)

/*!
 * @brief Counter 3 Start interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT3_START_EVENT (BTIMER_CPU_INT_IMASK_CNT3STRT_SET)

/*!
 * @brief Counter 3 Stop interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT3_STOP_EVENT (BTIMER_CPU_INT_IMASK_CNT3STOP_SET)

/*!
 * @brief Counter 4 Overflow interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT4_OVF_EVENT   (BTIMER_CPU_INT_IMASK_CNT4OVF_SET)

/*!
 * @brief Counter 4 Start interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT4_START_EVENT (BTIMER_CPU_INT_IMASK_CNT4STRT_SET)

/*!
 * @brief Counter 4 Stop interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT4_STOP_EVENT (BTIMER_CPU_INT_IMASK_CNT4STOP_SET)

/*!
 * @brief Counter 5 Overflow interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT5_OVF_EVENT   (BTIMER_CPU_INT_IMASK_CNT5OVF_SET)

/*!
 * @brief Counter 5 Start interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT5_START_EVENT (BTIMER_CPU_INT_IMASK_CNT5STRT_SET)

/*!
 * @brief Counter 5 Stop interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT5_STOP_EVENT (BTIMER_CPU_INT_IMASK_CNT5STOP_SET)

/*!
 * @brief Counter 6 Overflow interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT6_OVF_EVENT   (BTIMER_CPU_INT_IMASK_CNT6OVF_SET)

/*!
 * @brief Counter 6 Start interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT6_START_EVENT (BTIMER_CPU_INT_IMASK_CNT6STRT_SET)

/*!
 * @brief Counter 6 Stop interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT6_STOP_EVENT (BTIMER_CPU_INT_IMASK_CNT6STOP_SET)

/*!
 * @brief Counter 7 Overflow interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT7_OVF_EVENT   (BTIMER_CPU_INT_IMASK_CNT7OVF_SET)

/*!
 * @brief Counter 7 Start interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT7_START_EVENT (BTIMER_CPU_INT_IMASK_CNT7STRT_SET)

/*!
 * @brief Counter 7 Stop interrupt
 */
#define DL_TIMERB_INTERRUPT_CNT7_STOP_EVENT (BTIMER_CPU_INT_IMASK_CNT7STOP_SET)

/** @}*/

/** @addtogroup DL_TIMERB_EVENT
 *  @{
 */

/*!
 * @brief Counter 0 Overflow event
 */
#define DL_TIMERB_EVENT_CNT0_OVF_EVENT     (BTIMER_GEN_EVENT_IMASK_CNT0OVF_SET)

/*!
 * @brief Counter 0 Start event
 */
#define DL_TIMERB_EVENT_CNT0_START_EVENT  (BTIMER_GEN_EVENT_IMASK_CNT0STRT_SET)

/*!
 * @brief Counter 0 Stop event
 */
#define DL_TIMERB_EVENT_CNT0_STOP_EVENT   (BTIMER_GEN_EVENT_IMASK_CNT0STOP_SET)

/*!
 * @brief Counter 1 Overflow event
 */
#define DL_TIMERB_EVENT_CNT1_OVF_EVENT     (BTIMER_GEN_EVENT_IMASK_CNT1OVF_SET)

/*!
 * @brief Counter 1 Start event
 */
#define DL_TIMERB_EVENT_CNT1_START_EVENT  (BTIMER_GEN_EVENT_IMASK_CNT1STRT_SET)

/*!
 * @brief Counter 1 Stop event
 */
#define DL_TIMERB_EVENT_CNT1_STOP_EVENT   (BTIMER_GEN_EVENT_IMASK_CNT1STOP_SET)

/*!
 * @brief Counter 2 Overflow event
 */
#define DL_TIMERB_EVENT_CNT2_OVF_EVENT     (BTIMER_GEN_EVENT_IMASK_CNT2OVF_SET)

/*!
 * @brief Counter 2 Start event
 */
#define DL_TIMERB_EVENT_CNT2_START_EVENT  (BTIMER_GEN_EVENT_IMASK_CNT2STRT_SET)

/*!
 * @brief Counter 2 Stop event
 */
#define DL_TIMERB_EVENT_CNT2_STOP_EVENT   (BTIMER_GEN_EVENT_IMASK_CNT2STOP_SET)

/*!
 * @brief Counter 3 Overflow event
 */
#define DL_TIMERB_EVENT_CNT3_OVF_EVENT     (BTIMER_GEN_EVENT_IMASK_CNT3OVF_SET)

/*!
 * @brief Counter 3 Start event
 */
#define DL_TIMERB_EVENT_CNT3_START_EVENT  (BTIMER_GEN_EVENT_IMASK_CNT3STRT_SET)

/*!
 * @brief Counter 3 Stop event
 */
#define DL_TIMERB_EVENT_CNT3_STOP_EVENT   (BTIMER_GEN_EVENT_IMASK_CNT3STOP_SET)

/*!
 * @brief Counter 4 Overflow event
 */
#define DL_TIMERB_EVENT_CNT4_OVF_EVENT     (BTIMER_GEN_EVENT_IMASK_CNT4OVF_SET)

/*!
 * @brief Counter 4 Start event
 */
#define DL_TIMERB_EVENT_CNT4_START_EVENT  (BTIMER_GEN_EVENT_IMASK_CNT4STRT_SET)

/*!
 * @brief Counter 4 Stop event
 */
#define DL_TIMERB_EVENT_CNT4_STOP_EVENT   (BTIMER_GEN_EVENT_IMASK_CNT4STOP_SET)

/*!
 * @brief Counter 5 Overflow event
 */
#define DL_TIMERB_EVENT_CNT5_OVF_EVENT     (BTIMER_GEN_EVENT_IMASK_CNT5OVF_SET)

/*!
 * @brief Counter 5 Start event
 */
#define DL_TIMERB_EVENT_CNT5_START_EVENT  (BTIMER_GEN_EVENT_IMASK_CNT5STRT_SET)

/*!
 * @brief Counter 5 Stop event
 */
#define DL_TIMERB_EVENT_CNT5_STOP_EVENT   (BTIMER_GEN_EVENT_IMASK_CNT5STOP_SET)

/*!
 * @brief Counter 6 Overflow event
 */
#define DL_TIMERB_EVENT_CNT6_OVF_EVENT     (BTIMER_GEN_EVENT_IMASK_CNT6OVF_SET)

/*!
 * @brief Counter 6 Start event
 */
#define DL_TIMERB_EVENT_CNT6_START_EVENT  (BTIMER_GEN_EVENT_IMASK_CNT6STRT_SET)

/*!
 * @brief Counter 6 Stop event
 */
#define DL_TIMERB_EVENT_CNT6_STOP_EVENT   (BTIMER_GEN_EVENT_IMASK_CNT6STOP_SET)

/*!
 * @brief Counter 7 Overflow event
 */
#define DL_TIMERB_EVENT_CNT7_OVF_EVENT     (BTIMER_GEN_EVENT_IMASK_CNT7OVF_SET)

/*!
 * @brief Counter 7 Start event
 */
#define DL_TIMERB_EVENT_CNT7_START_EVENT  (BTIMER_GEN_EVENT_IMASK_CNT7STRT_SET)

/*!
 * @brief Counter 7 Stop event
 */
#define DL_TIMERB_EVENT_CNT7_STOP_EVENT   (BTIMER_GEN_EVENT_IMASK_CNT7STOP_SET)

/** @}*/

/* clang-format on */

/*! @enum DL_TIMERB_COUNTER_IDX */
typedef enum {
    /*! BTimer counter index 0 */
    DL_TIMERB_COUNTER_IDX_0 = 0,
    /*! BTimer counter index 1 */
    DL_TIMERB_COUNTER_IDX_1 = 1,
    /*! BTimer counter index 2 */
    DL_TIMERB_COUNTER_IDX_2 = 2,
    /*! BTimer counter index 3 */
    DL_TIMERB_COUNTER_IDX_3 = 3,
    /*! BTimer counter index 4 */
    DL_TIMERB_COUNTER_IDX_4 = 4,
    /*! BTimer counter index 5 */
    DL_TIMERB_COUNTER_IDX_5 = 5,
    /*! BTimer counter index 6 */
    DL_TIMERB_COUNTER_IDX_6 = 6,
    /*! BTimer counter index 7 */
    DL_TIMERB_COUNTER_IDX_7 = 7,
} DL_TIMERB_COUNTER_IDX;

/*! @enum DL_TIMERB_CLOCK_SOURCE */
typedef enum {
    /*! Selects BUSCLK as clock source */
    DL_TIMERB_CLOCK_SOURCE_BUSCLK = (0U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects overflow from counter 0 as clock source */
    DL_TIMERB_CLOCK_SOURCE_CNT0_OVERFLOW = (1U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects overflow from counter 1 as clock source */
    DL_TIMERB_CLOCK_SOURCE_CNT1_OVERFLOW = (2U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects overflow from counter 2 as clock source */
    DL_TIMERB_CLOCK_SOURCE_CNT2_OVERFLOW = (3U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects overflow from counter 3 as clock source */
    DL_TIMERB_CLOCK_SOURCE_CNT3_OVERFLOW = (4U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects overflow from counter 4 as clock source */
    DL_TIMERB_CLOCK_SOURCE_CNT4_OVERFLOW = (5U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects overflow from counter 5 as clock source */
    DL_TIMERB_CLOCK_SOURCE_CNT5_OVERFLOW = (6U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects overflow from counter 6 as clock source */
    DL_TIMERB_CLOCK_SOURCE_CNT6_OVERFLOW = (7U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects external event 1 as clock source */
    DL_TIMERB_CLOCK_SOURCE_EVENT1 = (8U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects external event 2 as clock source */
    DL_TIMERB_CLOCK_SOURCE_EVENT2 = (9U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects external event 3 as clock source */
    DL_TIMERB_CLOCK_SOURCE_EVENT3 = (10U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects external event 4 as clock source */
    DL_TIMERB_CLOCK_SOURCE_EVENT4 = (11U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects external event 5 as clock source */
    DL_TIMERB_CLOCK_SOURCE_EVENT5 = (12U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects external event 6 as clock source */
    DL_TIMERB_CLOCK_SOURCE_EVENT6 = (13U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects external event 7 as clock source */
    DL_TIMERB_CLOCK_SOURCE_EVENT7 = (14U << BTIMER_CTL0_CLKSEL_OFS),
    /*! Selects subscriber event as clock source */
    DL_TIMERB_CLOCK_SOURCE_SUBSCRIBER_EVENT = (15U << BTIMER_CTL0_CLKSEL_OFS),
} DL_TIMERB_CLOCK_SOURCE;

/*! @enum DL_TIMERB_START_SOURCE */
typedef enum {
    /*! Start source is unused */
    DL_TIMERB_START_SOURCE_UNUSED = (0U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects overflow from counter 0 as start source */
    DL_TIMERB_START_SOURCE_CNT0_OVERFLOW = (1U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects overflow from counter 1 as start source */
    DL_TIMERB_START_SOURCE_CNT1_OVERFLOW = (2U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects overflow from counter 2 as start source */
    DL_TIMERB_START_SOURCE_CNT2_OVERFLOW = (3U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects overflow from counter 3 as start source */
    DL_TIMERB_START_SOURCE_CNT3_OVERFLOW = (4U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects overflow from counter 4 as start source */
    DL_TIMERB_START_SOURCE_CNT4_OVERFLOW = (5U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects overflow from counter 5 as start source */
    DL_TIMERB_START_SOURCE_CNT5_OVERFLOW = (6U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects overflow from counter 6 as start source */
    DL_TIMERB_START_SOURCE_CNT6_OVERFLOW = (7U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects external event 1 as start source */
    DL_TIMERB_START_SOURCE_EVENT1 = (8U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects external event 2 as start source */
    DL_TIMERB_START_SOURCE_EVENT2 = (9U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects external event 3 as start source */
    DL_TIMERB_START_SOURCE_EVENT3 = (10U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects external event 4 as start source */
    DL_TIMERB_START_SOURCE_EVENT4 = (11U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects external event 5 as start source */
    DL_TIMERB_START_SOURCE_EVENT5 = (12U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects external event 6 as start source */
    DL_TIMERB_START_SOURCE_EVENT6 = (13U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects external event 7 as start source */
    DL_TIMERB_START_SOURCE_EVENT7 = (14U << BTIMER_CTL0_STARTSEL_OFS),
    /*! Selects subscriber event as start source */
    DL_TIMERB_START_SOURCE_SUBSCRIBER_EVENT =
        (15U << BTIMER_CTL0_STARTSEL_OFS),
} DL_TIMERB_START_SOURCE;

/*! @enum DL_TIMERB_STOP_SOURCE */
typedef enum {
    /*! Stop source is unused */
    DL_TIMERB_STOP_SOURCE_UNUSED = (0U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects overflow from counter 0 as stop source */
    DL_TIMERB_STOP_SOURCE_CNT0_OVERFLOW = (1U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects overflow from counter 1 as stop source */
    DL_TIMERB_STOP_SOURCE_CNT1_OVERFLOW = (2U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects overflow from counter 2 as stop source */
    DL_TIMERB_STOP_SOURCE_CNT2_OVERFLOW = (3U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects overflow from counter 3 as stop source */
    DL_TIMERB_STOP_SOURCE_CNT3_OVERFLOW = (4U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects overflow from counter 4 as stop source */
    DL_TIMERB_STOP_SOURCE_CNT4_OVERFLOW = (5U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects overflow from counter 5 as stop source */
    DL_TIMERB_STOP_SOURCE_CNT5_OVERFLOW = (6U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects overflow from counter 6 as stop source */
    DL_TIMERB_STOP_SOURCE_CNT6_OVERFLOW = (7U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects external event 1 as stop source */
    DL_TIMERB_STOP_SOURCE_EVENT1 = (8U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects external event 2 as stop source */
    DL_TIMERB_STOP_SOURCE_EVENT2 = (9U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects external event 3 as stop source */
    DL_TIMERB_STOP_SOURCE_EVENT3 = (10U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects external event 4 as stop source */
    DL_TIMERB_STOP_SOURCE_EVENT4 = (11U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects external event 5 as stop source */
    DL_TIMERB_STOP_SOURCE_EVENT5 = (12U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects external event 6 as stop source */
    DL_TIMERB_STOP_SOURCE_EVENT6 = (13U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects external event 7 as stop source */
    DL_TIMERB_STOP_SOURCE_EVENT7 = (14U << BTIMER_CTL0_STOPSEL_OFS),
    /*! Selects subscriber event as stop source */
    DL_TIMERB_STOP_SOURCE_SUBSCRIBER_EVENT = (15U << BTIMER_CTL0_STOPSEL_OFS),
} DL_TIMERB_STOP_SOURCE;

/*! @enum DL_TIMERB_RESET_SOURCE */
typedef enum {
    /*! Reset source is unused */
    DL_TIMERB_RESET_SOURCE_UNUSED = (0U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects overflow from counter 0 as reset source */
    DL_TIMERB_RESET_SOURCE_CNT0_OVERFLOW = (1U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects overflow from counter 1 as reset source */
    DL_TIMERB_RESET_SOURCE_CNT1_OVERFLOW = (2U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects overflow from counter 2 as reset source */
    DL_TIMERB_RESET_SOURCE_CNT2_OVERFLOW = (3U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects overflow from counter 3 as reset source */
    DL_TIMERB_RESET_SOURCE_CNT3_OVERFLOW = (4U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects overflow from counter 4 as reset source */
    DL_TIMERB_RESET_SOURCE_CNT4_OVERFLOW = (5U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects overflow from counter 5 as reset source */
    DL_TIMERB_RESET_SOURCE_CNT5_OVERFLOW = (6U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects overflow from counter 6 as reset source */
    DL_TIMERB_RESET_SOURCE_CNT6_OVERFLOW = (7U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects external event 1 as reset source */
    DL_TIMERB_RESET_SOURCE_EVENT1 = (8U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects external event 2 as reset source */
    DL_TIMERB_RESET_SOURCE_EVENT2 = (9U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects external event 3 as reset source */
    DL_TIMERB_RESET_SOURCE_EVENT3 = (10U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects external event 4 as reset source */
    DL_TIMERB_RESET_SOURCE_EVENT4 = (11U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects external event 5 as reset source */
    DL_TIMERB_RESET_SOURCE_EVENT5 = (12U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects external event 6 as reset source */
    DL_TIMERB_RESET_SOURCE_EVENT6 = (13U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects external event 7 as reset source */
    DL_TIMERB_RESET_SOURCE_EVENT7 = (14U << BTIMER_CTL0_RESETSEL_OFS),
    /*! Selects subscriber event as reset source */
    DL_TIMERB_RESET_SOURCE_SUBSCRIBER_EVENT =
        (15U << BTIMER_CTL0_RESETSEL_OFS),
} DL_TIMERB_RESET_SOURCE;

/*! @enum DL_TIMERB_IIDX */
typedef enum {
    /*! Timer interrupt index for no pending interrupt */
    DL_TIMERB_IIDX_ZERO = BTIMER_CPU_INT_IIDX_STAT_NO_INTR,
    /*! Timer interrupt index for counter 0 period match interrupt */
    DL_TIMERB_IIDX_CNT0_OVERFLOW = BTIMER_CPU_INT_IIDX_STAT_CNT0OVF,
    /*! Timer interrupt index for counter 0 start interrupt */
    DL_TIMERB_IIDX_CNT0_START = BTIMER_CPU_INT_IIDX_STAT_CNT0STRT,
    /*! Timer interrupt index for counter 0 stop interrupt */
    DL_TIMERB_IIDX_CNT0_STOP = BTIMER_CPU_INT_IIDX_STAT_CNT0STOP,
    /*! Timer interrupt index for counter 1 period match interrupt */
    DL_TIMERB_IIDX_CNT1_OVERFLOW = BTIMER_CPU_INT_IIDX_STAT_CNT1OVF,
    /*! Timer interrupt index for counter 1 start interrupt */
    DL_TIMERB_IIDX_CNT1_START = BTIMER_CPU_INT_IIDX_STAT_CNT1STRT,
    /*! Timer interrupt index for counter 1 stop interrupt */
    DL_TIMERB_IIDX_CNT1_STOP = BTIMER_CPU_INT_IIDX_STAT_CNT1STOP,
    /*! Timer interrupt index for counter 2 period match interrupt */
    DL_TIMERB_IIDX_CNT2_OVERFLOW = BTIMER_CPU_INT_IIDX_STAT_CNT2OVF,
    /*! Timer interrupt index for counter 2 start interrupt */
    DL_TIMERB_IIDX_CNT2_START = BTIMER_CPU_INT_IIDX_STAT_CNT2STRT,
    /*! Timer interrupt index for counter 2 stop interrupt */
    DL_TIMERB_IIDX_CNT2_STOP = BTIMER_CPU_INT_IIDX_STAT_CNT2STOP,
    /*! Timer interrupt index for counter 3 period match interrupt */
    DL_TIMERB_IIDX_CNT3_OVERFLOW = BTIMER_CPU_INT_IIDX_STAT_CNT3OVF,
    /*! Timer interrupt index for counter 3 start interrupt */
    DL_TIMERB_IIDX_CNT3_START = BTIMER_CPU_INT_IIDX_STAT_CNT3STRT,
    /*! Timer interrupt index for counter 3 stop interrupt */
    DL_TIMERB_IIDX_CNT3_STOP = BTIMER_CPU_INT_IIDX_STAT_CNT3STOP,
    /*! Timer interrupt index for counter 4 period match interrupt */
    DL_TIMERB_IIDX_CNT4_OVERFLOW = BTIMER_CPU_INT_IIDX_STAT_CNT4OVF,
    /*! Timer interrupt index for counter 4 start interrupt */
    DL_TIMERB_IIDX_CNT4_START = BTIMER_CPU_INT_IIDX_STAT_CNT4STRT,
    /*! Timer interrupt index for counter 4 stop interrupt */
    DL_TIMERB_IIDX_CNT4_STOP = BTIMER_CPU_INT_IIDX_STAT_CNT4STOP,
    /*! Timer interrupt index for counter 5 period match interrupt */
    DL_TIMERB_IIDX_CNT5_OVERFLOW = BTIMER_CPU_INT_IIDX_STAT_CNT5OVF,
    /*! Timer interrupt index for counter 5 start interrupt */
    DL_TIMERB_IIDX_CNT5_START = BTIMER_CPU_INT_IIDX_STAT_CNT5STRT,
    /*! Timer interrupt index for counter 5 stop interrupt */
    DL_TIMERB_IIDX_CNT5_STOP = BTIMER_CPU_INT_IIDX_STAT_CNT5STOP,
    /*! Timer interrupt index for counter 6 period match interrupt */
    DL_TIMERB_IIDX_CNT6_OVERFLOW = BTIMER_CPU_INT_IIDX_STAT_CNT6OVF,
    /*! Timer interrupt index for counter 6 start interrupt */
    DL_TIMERB_IIDX_CNT6_START = BTIMER_CPU_INT_IIDX_STAT_CNT6STRT,
    /*! Timer interrupt index for counter 6 stop interrupt */
    DL_TIMERB_IIDX_CNT6_STOP = BTIMER_CPU_INT_IIDX_STAT_CNT6STOP,
    /*! Timer interrupt index for counter 7 period match interrupt */
    DL_TIMERB_IIDX_CNT7_OVERFLOW = BTIMER_CPU_INT_IIDX_STAT_CNT7OVF,
    /*! Timer interrupt index for counter 7 start interrupt */
    DL_TIMERB_IIDX_CNT7_START = BTIMER_CPU_INT_IIDX_STAT_CNT7STRT,
    /*! Timer interrupt index for counter 7 stop interrupt */
    DL_TIMERB_IIDX_CNT7_STOP = BTIMER_CPU_INT_IIDX_STAT_CNT7STOP,
} DL_TIMERB_IIDX;

/*! @enum  DL_TIMERB_CORE_HALT */
typedef enum {
    /*! Counter will halt immediately, even if the resultant state will result
        in corruption if the system is restarted */
    DL_TIMERB_CORE_HALT_IMMEDIATE =
        (BTIMER_PDBGCTL_FREE_STOP | BTIMER_PDBGCTL_SOFT_IMMEDIATE),
    /*! Counter stops on reaching 0. When the debug halt condition is removed,
        the counter starts from the current value */
    DL_TIMERB_CORE_HALT_DELAYED =
        (BTIMER_PDBGCTL_FREE_STOP | BTIMER_PDBGCTL_SOFT_DELAYED),
    /*! Counter ignores the state of the Core Halted input */
    DL_TIMERB_CORE_HALT_FREE_RUN =
        (BTIMER_PDBGCTL_FREE_RUN | BTIMER_PDBGCTL_SOFT_DELAYED),
} DL_TIMERB_CORE_HALT;

/*!
 *  @brief  Configuration struct for @ref DL_TimerB_initTimer.
 */
typedef struct {
    /*! Counter clock source. One of @ref DL_TIMERB_CLOCK_SOURCE */
    DL_TIMERB_CLOCK_SOURCE clockSource;
    /*! Counter start source. One of @ref DL_TIMERB_START_SOURCE */
    DL_TIMERB_START_SOURCE startSource;
    /*! Counter stop source. One of @ref DL_TIMERB_STOP_SOURCE */
    DL_TIMERB_STOP_SOURCE stopSource;
    /*! Counter reset source. One of @ref DL_TIMERB_RESET_SOURCE */
    DL_TIMERB_RESET_SOURCE resetSource;
    /*! Load value. Range of [0, 65535] */
    uint16_t loadValue;
    /*! Start timer after configuration  */
    bool startTimer;
} DL_TimerB_TimerConfig;

/**
 * @brief Enables the Peripheral Write Enable (PWREN) register for the timer
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 * @param timerb              Pointer to the register overlay for the
 *                            peripheral
 */
__STATIC_INLINE void DL_TimerB_enablePower(BTIMER_Regs* const timerb)
{
    timerb->GPRCM.PWREN =
        (BTIMER_PWREN_KEY_UNLOCK_W | BTIMER_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables the Peripheral Write Enable (PWREN) register for the timer
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 *  @note This API does not provide large power savings.
 *
 * @param timerb              Pointer to the register overlay for the
 *                            peripheral
 */
__STATIC_INLINE void DL_TimerB_disablePower(BTIMER_Regs* const timerb)
{
    timerb->GPRCM.PWREN =
        (BTIMER_PWREN_KEY_UNLOCK_W | BTIMER_PWREN_ENABLE_DISABLE);
}

